{
  "backend/main.mo": "Motoko backend handling user profiles, game configuration, farm data storage, and admin-gated updates with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across gameplay, UI, and config systems.",
  "frontend/index.css": "Global Tailwind-based styling with color variables, dark mode rules, and base element styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/PLAY_STORE.md": "Guide for packaging the web-based game into an Android WebView wrapper for Play Store publishing.",
  "frontend/src/admin/AdminConfigPanel.tsx": "Admin-only panel for viewing and updating game configuration values with form inputs and save actions.",
  "frontend/src/admin/useAdminStatus.ts": "Hook to determine whether the current user is authenticated and has admin permissions.",
  "frontend/src/App.tsx": "Root React component controlling the game state flow and loading game configuration on startup.",
  "frontend/src/game/assets/textures.ts": "Exports paths for all generated texture assets used in the 3D scene.",
  "frontend/src/game/config/applyConfig.ts": "Converts backend GameConfig into simplified runtime parameters for gameplay and scene behavior.",
  "frontend/src/game/config/defaults.ts": "Defines default game configuration values used as a fallback when backend data is unavailable.",
  "frontend/src/game/config/useGameConfig.ts": "Hook that loads game config from backend with fallback defaults for safe initialization.",
  "frontend/src/game/gameplay/activities/HarvestingActivity.ts": "Tracks harvesting actions on field plots, updating progress and score when the action button is used on new cells.",
  "frontend/src/game/gameplay/activities/PlowingActivity.ts": "Detects visited field rows as the tractor moves and increments completion and score for each new cell plowed.",
  "frontend/src/game/gameplay/activities/SowingActivity.ts": "Handles sowing interactions triggered by action presses, marking new plots and updating completion and score.",
  "frontend/src/game/gameplay/activities/types.ts": "Defines activity data structures, callbacks, and a helper that builds activity definitions from game config.",
  "frontend/src/game/gameplay/ActivityManager.ts": "Coordinates plowing, sowing, and harvesting activities, tracking progress, score, and timing while updating based on tractor position and controls.",
  "frontend/src/game/input/OnScreenControls.tsx": "Implements mobile on‑screen throttle, steering, and action controls, exposing current state globally.",
  "frontend/src/game/input/types.ts": "Defines the ControlState interface for throttle, steering, and action inputs.",
  "frontend/src/game/input/useCombinedControls.ts": "Merges keyboard and on‑screen control inputs into a single ControlState.",
  "frontend/src/game/input/useKeyboardControls.ts": "Maps keyboard input to throttle, steering, and action states using key listeners.",
  "frontend/src/game/screens/GameOverScreen.tsx": "Displays final score, reason for game over, and buttons to restart or return to menu.",
  "frontend/src/game/screens/GameScreen.tsx": "Initializes and runs the game loop, rendering the 3D scene, HUD, controls, and coordinating with ActivityManager.",
  "frontend/src/game/screens/StartScreen.tsx": "Shows the main menu with authentication, profile setup, and a button to start the game.",
  "frontend/src/game/three/FarmScene.tsx": "Renders the 3D farm environment, updates tractor position via activity manager, and includes lighting, terrain, props, and the tractor rig.",
  "frontend/src/game/three/TractorRig.tsx": "Implements tractor physics, movement, and model rendering, exposing position via an imperative handle.",
  "frontend/src/game/ui/HUD.tsx": "Displays objective, progress, score, timer, and control hints with color themes based on the current activity.",
  "frontend/src/game/ui/layout.ts": "Defines layout constants for HUD scaling, control sizes, safe-area padding, and breakpoints.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, invalidating queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers using Internet Identity, managing login, stored identity, and context.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for configs, profiles, admin checks, and persistent farm data using React Query.",
  "frontend/src/index.css": "Global Tailwind setup with theming variables, dark mode settings, layout resets, and mobile optimizations.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes the project’s current state and planned game features for a 3D tractor farming game with content-driven updates and admin tooling."
}